## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                    NAME                    |
|--------|--------------------------------------------|
| add    | `aws_glue_job.platform_support_freshdesk`  |
|        | `aws_s3_object.platform_support_freshdesk` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_glue_job.platform_support_freshdesk will be created
  + resource "aws_glue_job" "platform_support_freshdesk" {
      + arn                    = (known after apply)
      + default_arguments      = {
          + "--additional-python-modules"        = "awswrangler==3.11.0"
          + "--continuous-log-logGroup"          = "/aws-glue/jobs/encryption-at-rest/service-role/AWSGlueETL-DataLake/output"
          + "--continuous-log-logStreamPrefix"   = "platform_support_freshdesk"
          + "--database_name_raw"                = "platform_support_production_raw"
          + "--database_name_transformed"        = "platform_support_production"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-metrics"                   = "true"
          + "--enable-observability-metrics"     = "true"
          + "--source_bucket"                    = "cds-data-lake-raw-production"
          + "--source_prefix"                    = "platform/support/freshdesk/"
          + "--table_name"                       = "platform_support_freshdesk"
          + "--transformed_bucket"               = "cds-data-lake-transformed-production"
          + "--transformed_prefix"               = "platform/support/freshdesk/"
        }
      + glue_version           = (known after apply)
      + id                     = (known after apply)
      + max_capacity           = (known after apply)
      + name                   = "Platform / Support / Freshdesk"
      + number_of_workers      = (known after apply)
      + role_arn               = "arn:aws:iam::739275439843:role/service-role/AWSGlueETL-DataLake"
      + security_configuration = "encryption-at-rest"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + timeout                = 15
      + worker_type            = (known after apply)

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://cds-data-lake-glue-production/platform/support/freshdesk/process_tickets.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_s3_object.platform_support_freshdesk will be created
  + resource "aws_s3_object" "platform_support_freshdesk" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "cds-data-lake-glue-production"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "69bb3310105ed544b8c572547aaae245"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "platform/support/freshdesk/process_tickets.py"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./etl/platform/support/freshdesk/scripts/process_tickets.py"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.forms_generate_test_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.aws_glue"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.forms_generate_test_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.platform_support_freshdesk"]

37 tests, 19 passed, 18 warnings, 0 failures, 0 exceptions

```

</details>
